CSI API ETABS v1

# cPointElmGetRestraint Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetRestraint(
    	string Name,
    	ref bool[] Value
    )

    Function GetRestraint (
    	Name As String,
    	ByRef Value As Boolean()
    ) As Integer

    Dim instance As cPointElm
    Dim Name As String
    Dim Value As Boolean()
    Dim returnValue As Integer

    returnValue = instance.GetRestraint(Name,
    	Value)

    int GetRestraint(
    	String^ Name,
    	array<bool>^% Value
    )

    abstract GetRestraint :
            Name : string *
            Value : bool[] byref -> int

#### Parameters

Name

    Type: SystemString

Value

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cPointElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com